# AlternateUnits Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DimensionType..::..AlternateUnits Property
DimensionType Class See Also
---
The alternate units display mode for this DimensionType.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public AlternateUnits AlternateUnits { get; set; }
```

Visual Basic
---
```text
Public Property AlternateUnits As AlternateUnits
	Get
	Set
```

Visual C++
---
```text
public:
property AlternateUnits AlternateUnits {
	AlternateUnits get ();
	void set (AlternateUnits value);
}
```

# ### Field Value
Alternate units let dimensions display values in multiple units. For example, for a dimension which shows its values in imperial units, alternate units can be used to repeat those values in metric units.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DimensionType Class
Autodesk.Revit.DB Namespace